---
kind: method
id: M:Autodesk.Revit.UI.UIDocument.RefreshActiveView
source: html/5d9f248c-a1be-ac2e-1f4c-2219ed0fc5ae.htm
---
# Autodesk.Revit.UI.UIDocument.RefreshActiveView Method

Refresh the display of the active view in the active document.

## Syntax (C#)
```csharp
public void RefreshActiveView()
```